cybersource-sdk-php-master/samples/xml/test.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>tstsecretary</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">2018Tst1</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <data:requestMessage xmlns:data="urn:schemas-cybersource-com:transaction-data:TransactionProcessor">
            <merchantID>tst_mo_acct</merchantID>
            <merchantReferenceCode>MRC-123</merchantReferenceCode>
            <billTo>
                <firstName>John</firstName>
                <lastName>Doe</lastName>
                <street1>1295 Charleston Road</street1>
                <city>Mountain View</city>
                <state>CA</state>
                <postalCode>94043</postalCode>
                <country>US</country>
                <email>null@cybersource.com</email>
            </billTo>
            <item id="0">
                <unitPrice>5.00</unitPrice>
                <quantity>1</quantity>
            </item>
            <item id="1">
                <unitPrice>10.00</unitPrice>
                <quantity>2</quantity>
            </item>
            <purchaseTotals>
                <currency>USD</currency>
            </purchaseTotals>
            <card>
                <accountNumber>4111111111111111</accountNumber>
                <expirationMonth>11</expirationMonth>
                <expirationYear>2020</expirationYear>
            </card>
            <ccAuthService run="true" />
        </data:requestMessage>
    </soapenv:Body>
</soapenv:Envelope>   
